/*==============================================================================
                         ##### How to use this driver #####
==============================================================================
卡尔曼滤波器的使用方法可直接调用KalmanFilter即可


*/
//外部文件引用
#include "kalman.h"
#include <math.h>


//宏定义区



//Extern引用



//私有函数区



//私有变量区
/******************************************************************************
  * 函数名称：KalmanFilter
  * 函数描述：卡尔曼滤波器
  * 输    入：EKF_Filter_t *ekf：卡尔曼滤波器结构体指针
             float input：输入数据
  * 输    出：void
  * 返    回：void
  * 备    注：null
  *    
  *
******************************************************************************/
void KalmanFilter(EKF_Filter_t *ekf, float input)  //一维卡尔曼
{
    ekf->Now_P = ekf->LastP + ekf->Q;
    ekf->Kg = ekf->Now_P / (ekf->Now_P + ekf->R);
    ekf->out = ekf->out + ekf->Kg * (input - ekf->out);
    ekf->LastP = (1 - ekf->Kg) * ekf->Now_P ;
}


/******************* (C) 版权所有 2018 北京中科浩电科技有限公司 *******************/
