/**
  ******************************************************************************
  * Copyright (c) 2018,北京中科浩电科技有限公司
  * All rights reserved.
  * 文件名称：height_control.h
  * 摘    要：
  *
  * 当前版本：V1.0
  * 作    者：北京中科浩电科技有限公司研发部 
  * 完成日期：    
  * 修改说明：
  * 
  *
  * 历史版本：
  *
  *
  *******************************************************************************/
#ifndef __pos_ctrl_H
#define __pos_ctrl_H
//外部文件引用
#include "include.h"


//宏定义区


//数据结构声明


//Extern引用
extern float pos_out_trans[];



//函数声明
void POS_Ctrl(float dT_s);

#endif

/******************* (C) 版权所有 2018 北京中科浩电科技有限公司 *******************/

